### 판다스 PART6 과제

- 1. 함수 매핑

<예제 6-1> 시리즈의 원소에 apply() 적용  ( 350page )

In [1]:
import pandas as pd

DATA_FILE = '../Data/titanic.csv'
titanic = pd.read_csv(DATA_FILE)
df = titanic.loc[:, ['age','fare']]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [2]:
# 사용자 함수 정의
def add_10(n):
    return n + 10

def add_two_obj(a, b):
    return a + b

print(add_10(10))
print(add_two_obj(10, 10))

20
20

In [3]:
# 시리즈 객체에 적용
sr1 = df['age'].apply(add_10)
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [4]:
# 람다 함수 활용 : 시리즈 객체에 적용
sr2 = df['age'].apply(lambda n: n + 10)
sr2.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [5]:
# 함수의 매개변수가 2개 이상인 경우(예: 시리즈 + 숫자)
sr3 = df['age'].apply(add_two_obj, b=10)
sr3.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [6]:
# 함수의 매개변수가 2개 이상인 경우(람다 함수 활용)
sr4 = df['age'].apply(lambda a, b : a + b, b=10)
sr4.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [7]:
# 시리즈 객체에 함수를 적용
def over_thirty(age):
    return age > 30

sr_map = df['age'].map(over_thirty)
sr_map.head()

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [8]:
# 시리즈 객체에 함수를 적용(람다 함수 활용)
sr_map2 = df['age'].map(lambda age: True if age > 30 else False)
sr_map2.head()

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [9]:
# titanic 데이터의 성별 데이터의 고유값
print(titanic['sex'].unique())
print(titanic['sex'].head())

# 딕셔너리 정의하여 값을 변환(문자열 -> 정수)
over_forty_dict = {'male' : 0, 'female':1}
titanic['gender'] = titanic['sex'].map(over_forty_dict)
print(titanic['gender'].head())

['male' 'female']
0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object
0    0
1    1
2    1
3    1
4    0
Name: gender, dtype: int64

<예제 6-2> 데이터프레임 원소에 map() 적용  ( 355page )

In [10]:
# 데이터프레임의 모든 원소를 add_10() 함수에 매핑
df1 = df.map(add_10)
df1.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [11]:
# 람다 함수 활용
df2 = df.map(lambda n: n + 10)
df2.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [12]:
# 함수의 매개변수가 2개 이상인 경우
df3 = df.map(add_two_obj, b=10)
df3.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [13]:
# 함수의 매개변수가 2개 이상인 경우(람다 함수 활용)
df4 = df.map(lambda a, b: a+b, b=10)
df4.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

<예제 6-3> 데이터프레임에 apply(axis=0) 적용  ( 358page )

In [14]:
def calculate_stats(col):
    
    max_val = col.max()
    min_val = col.min()
    mean_val = col.mean()
    median_val = col.median()

    # 새로운 시리즈 반환
    return pd.Series([max_val, min_val, mean_val, median_val], index=['Max', 'Min','Mean', 'Median'])

# 각 열에 calculate_stats 함수 적용(데이터프레임을 반환)
result_df = df.apply(calculate_stats, axis=0)

result_df

              age        fare
Max     80.000000  512.329200
Min      0.420000    0.000000
Mean    29.699118   32.204208
Median  28.000000   14.454200

In [15]:
# 각 열에 람다 함수 적용(시리즈를 반환)
result_sr = df.apply(lambda x: x.max() - x.min(), axis=0)

result_sr

age      79.5800
fare    512.3292
dtype: float64

In [16]:
# 각 행에 대해 최댓값과 최솟값의 차이와 평균을 계산하는 함수
def calculate_diff_avg(row):
    diff = row.max() - row.min()
    avg = row.mean()
    # 새로운 시리즈 반환
    return pd.Series([diff, avg], index=['차이', '평균'])

# apply 함수를 사용하여 각 행에 calculate_diff_avg 함수 적용
result_df2 = df.apply(calculate_diff_avg, axis=1)

result_df2

          차이        평균
0    14.7500  14.62500
1    33.2833  54.64165
2    18.0750  16.96250
3    18.1000  44.05000
4    26.9500  21.52500
..       ...       ...
886  14.0000  20.00000
887  11.0000  24.50000
888   0.0000  23.45000
889   4.0000  28.00000
890  24.2500  19.87500

[891 rows x 2 columns]

In [17]:
# 람다 함수를 사용하여 각 행에 대한 계산 적용(multiplier 매개변수를 추가)
result_df3 = df.apply(lambda row, multiplier: pd.Series([(row.max() - row.min()) * multiplier, row.mean()],
                                            index=['차이','평균']),
                                            multiplier = 2, axis = 1)

result_df3

          차이        평균
0    29.5000  14.62500
1    66.5666  54.64165
2    36.1500  16.96250
3    36.2000  44.05000
4    53.9000  21.52500
..       ...       ...
886  28.0000  20.00000
887  22.0000  24.50000
888   0.0000  23.45000
889   8.0000  28.00000
890  48.5000  19.87500

[891 rows x 2 columns]

In [18]:
# 평균값이 30을 초과하는 열만 필터링
filtered_columns = df.apply(lambda x: x.mean() > 30)
print(filtered_columns, "\n")

# 필터링된 열을 기반으로 새로운 데이터프레임 생성
filtered_df = df.loc[:, filtered_columns]

filtered_df

age     False
fare     True
dtype: bool

        fare
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
..       ...
886  13.0000
887  30.0000
888  23.4500
889  30.0000
890   7.7500

[891 rows x 1 columns]

In [19]:
# 각 행의 평균값이 50을 초과하는지 여부에 따라 'High' 열 추가
df['High'] = df.apply(lambda row: 'Yes' if row.mean() > 50 else 'No', axis=1)

df

      age     fare High
0    22.0   7.2500   No
1    38.0  71.2833  Yes
2    26.0   7.9250   No
3    35.0  53.1000   No
4    35.0   8.0500   No
..    ...      ...  ...
886  27.0  13.0000   No
887  19.0  30.0000   No
888   NaN  23.4500   No
889  26.0  30.0000   No
890  32.0   7.7500   No

[891 rows x 3 columns]

<예제 6-4> 데이터프레임 객체에 pipe() 적용  ( 364page )

In [20]:
df1 = titanic.loc[:, ['age','fare']]
df2 = titanic.loc[:, ['embark_town','embarked']]

def missing_value(df):
    return df.isnull()

result_df = df1.pipe(missing_value)
result_df

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

In [21]:
# 각 열의 NaN 개수 반환 - 데이터프레임을 전달하면 시리즈 반환
def missing_count(df):
    return missing_value(df).sum()

result_series = df1.pipe(missing_count)
result_series

age     177
fare      0
dtype: int64

In [22]:
# 데이터프레임의 총 NaN 개수 - 데이터프레임을 전달하면 값 반환
def totoal_number_missing(df):
    return missing_count(df).sum()

result_value = df1.pipe(totoal_number_missing)
result_value

np.int64(177)

In [23]:
# chain method - 함수 활용
def extract_initial(df):
    df['town_initial'] = df['embark_town'].str[0]
    return df

def verify_initial(df):
    df['verified'] = df['embarked'] == df['town_initial']
    return df

verify_initial(extract_initial(df2))

     embark_town embarked town_initial  verified
0    Southampton        S            S      True
1      Cherbourg        C            C      True
2    Southampton        S            S      True
3    Southampton        S            S      True
4    Southampton        S            S      True
..           ...      ...          ...       ...
886  Southampton        S            S      True
887  Southampton        S            S      True
888  Southampton        S            S      True
889    Cherbourg        C            C      True
890   Queenstown        Q            Q      True

[891 rows x 4 columns]

In [24]:
# chain method - pipe 활용
df2.pipe(extract_initial).pipe(verify_initial)
df2

     embark_town embarked town_initial  verified
0    Southampton        S            S      True
1      Cherbourg        C            C      True
2    Southampton        S            S      True
3    Southampton        S            S      True
4    Southampton        S            S      True
..           ...      ...          ...       ...
886  Southampton        S            S      True
887  Southampton        S            S      True
888  Southampton        S            S      True
889    Cherbourg        C            C      True
890   Queenstown        Q            Q      True

[891 rows x 4 columns]

- 2. 열 재구성

<예제 6-5> 열 순서 바꾸기  ( 368page )

In [25]:
df = titanic.loc[:, 'survived':'age']

df.head()

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [26]:
# 열 이름의 리스트 만들기
columns = list(df.columns.values)
print(columns)

['survived', 'pclass', 'sex', 'age']

In [27]:
# 열 이름을 알파벳 순으로 정렬하기
columns_sorted = sorted(columns, reverse=False)
df_sorted = df[columns_sorted]
df_sorted.head()

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [28]:
# 열 이름을 기존 순서의 내림차순으로 정렬하기
columns_reversed = sorted(columns, reverse=True)
df_sorted = df[columns_reversed]
df_sorted.head()

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [29]:
# 열 이름을 사용자가 정의한 임의의 순서로 재배치하기
columns_customed = ['pclass', 'sex', 'age', 'survived']
df_customed = df[columns_customed]
print(df_customed)

     pclass     sex   age  survived
0         3    male  22.0         0
1         1  female  38.0         1
2         3  female  26.0         1
3         1  female  35.0         1
4         3    male  35.0         0
..      ...     ...   ...       ...
886       2    male  27.0         0
887       1  female  19.0         1
888       3  female   NaN         0
889       1    male  26.0         1
890       3    male  32.0         0

[891 rows x 4 columns]

<예제 6-6> 열 분리하기  ( 370page )

In [30]:
df = pd.read_excel('../Data/주가데이터.xlsx')

df.head()

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

In [31]:
# 연, 월, 일 데이터 분리하기
df['연월일'] = df['연월일'].astype('str')
dates = df['연월일'].str.split('-')

dates.head()

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

In [32]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)
df.head()

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

In [33]:
# expand 옵션
df_expand = df['연월일'].str.split('-', expand=True)

df_expand.head()

      0   1   2
0  2018  07  02
1  2018  06  29
2  2018  06  28
3  2018  06  27
4  2018  06  26

- 3. 그룹 연산

<예제 6-7> 그룹 연산 - 분할  ( 373page )

In [34]:

df = titanic.loc[:, ['age','sex', 'class', 'fare', 'survived']]

df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [35]:
# class 열을 기준으로 분할
grouped = df.groupby(['class'], observed=True)
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A872D82B90>

In [36]:
# 그룹 객체를 iteration으로 출력: head() 메소드로 첫 5행만을 출력
for key, group in grouped:
    print('* key :', key)
    print('* number :', len(group))
    print(group.head())
    print('\n')

* key : ('First',)
* number : 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1


* key : ('Second',)
* number : 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


* key : ('Third',)
* number : 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [37]:
# 연산 메소드 적용
average = grouped.mean(numeric_only=True)
average

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [38]:
# 개별 그룹 선택하기
group3 = grouped.get_group(('Third',))
group3.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [39]:
# class 열, sex 열을 기준으로 분할
grouped_two = df.groupby(['class', 'sex'], observed=True)

# grouped_two 그룹 객체를 iteration으로 출력
for key, group in grouped_two:
    print('* key :', key)
    print('* number :', len(group))
    print(group.head())
    print('\n')

* key : ('First', 'female')
* number : 94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1


* key : ('First', 'male')
* number : 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0


* key : ('Second', 'female')
* number : 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1


* key : ('Second', 'male')
* number : 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0


* key : ('Third', 'female')
* number : 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0


* key : ('Third', 'male')
* number : 347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [40]:
# grouped_two 그룹 객체에 연산 메소드 적용
average_two = grouped_two.mean(numeric_only=True)
average_two

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [41]:
# grouped_two 그룹 객체에서 개별 그룹 선택하기
group3f = grouped_two.get_group(('Third','female'))
group3f.head()

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

<예제 6-8> 데이터 집계  ( 380page )

In [42]:
grouped = df.groupby(['class'], observed=True)

# 각 그룹에 대한 모든 열의 표준편차를 집계하여 데이터프레임으로 반환
std_all = grouped.std(numeric_only=True)

std_all

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949

In [43]:
# 각 그룹에 대한 모든 열의 표준편차를 집계(as_index=False)
std_all_index = df.groupby(['class'], observed=True, as_index=False).std(numeric_only=True)

std_all_index

    class        age       fare  survived
0   First  14.802856  78.380373  0.484026
1  Second  14.001077  13.417399  0.500623
2   Third  12.495398  11.778142  0.428949

In [44]:
# fare 열의 표준편차를 선택
std_all['fare']

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [45]:
# 각 그룹에 대한 fare 열의 표준편차를 집계하여 시리즈로 반환
std_fare = grouped['fare'].std(numeric_only=True)
std_fare

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [46]:
std_age_survived = grouped[['age', 'survived']].std(numeric_only=True)
std_age_survived

              age  survived
class
First   14.802856  0.484026
Second  14.001077  0.500623
Third   12.495398  0.428949

In [47]:
# 각 그룹에 대한 요약 통계
grouped.describe()

          age                                                       fare  \
        count       mean        std   min   25%   50%   75%   max  count
class
First   186.0  38.233441  14.802856  0.92  27.0  37.0  49.0  80.0  216.0
Second  173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0  184.0
Third   355.0  25.140620  12.495398  0.42  18.0  24.0  32.0  74.0  491.0

                   ...                 survived                                \
             mean  ...   75%       max    count      mean       std  min  25%
class              ...
First   84.154687  ...  93.5  512.3292    216.0  0.629630  0.484026  0.0  0.0
Second  20.662183  ...  26.0   73.5000    184.0  0.472826  0.500623  0.0  0.0
Third   13.675550  ...  15.5   69.5500    491.0  0.242363  0.428949  0.0  0.0


        50%  75%  max
class
First   1.0  1.0  1.0
Second  0.0  1.0  1.0
Third   0.0  0.0  1.0

[3 rows x 24 columns]

In [48]:
# 각 그룹에 대한 고유값의 빈도 수
grouped[['class', 'sex']].value_counts()

class   sex
First   male      122
        female     94
Second  male      108
        female     76
Third   male      347
        female    144
Name: count, dtype: int64

In [49]:
# 그룹 객체에 aggregate() 메소드 적용(mean 함수를 모든 열에 적용)
agg_mean = grouped.aggregate('mean', numeric_only=True)
agg_mean

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [50]:
# 그룹 객체에 agg() 메소드 적용(mean 함수를 모든 열에 적용)
agg_mean2 = grouped.agg('mean', numeric_only=True)
agg_mean2

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [51]:
# 여러 함수를 각 열에 동일하게 적용하여 집계
agg_all = grouped.agg(['min', 'max'])
agg_all

         age           sex       fare           survived
         min   max     min   max  min       max      min max
class
First   0.92  80.0  female  male  0.0  512.3292        0   1
Second  0.67  70.0  female  male  0.0   73.5000        0   1
Third   0.42  74.0  female  male  0.0   69.5500        0   1

In [52]:
# 각 열마다 다른 함수를 적용하여 집계
agg_sep = grouped.agg({'fare':['min','max'], 'age':'mean'})
agg_sep

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

In [53]:
# 그룹 객체에 agg() 메소드 적용 - 사용자 정의 함수를 인수로 전달
def min_max(x):         # 최댓값 - 최솟값
    return x.max() - x.min()

# 각 그룹의 최댓값과 최솟값의 차이를 계산하여 그룹별로 집계
agg_minmax = grouped[['age', 'fare']].agg(min_max)

agg_minmax

          age      fare
class
First   79.08  512.3292
Second  69.33   73.5000
Third   73.58   69.5500

<예제 6-9> 데이터 변환  ( 387page )

In [54]:
df = titanic.loc[:, ['age','sex','class','fare','survived']]

df

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
1    38.0  female   First  71.2833         1
2    26.0  female   Third   7.9250         1
3    35.0  female   First  53.1000         1
4    35.0    male   Third   8.0500         0
..    ...     ...     ...      ...       ...
886  27.0    male  Second  13.0000         0
887  19.0  female   First  30.0000         1
888   NaN  female   Third  23.4500         0
889  26.0    male   First  30.0000         1
890  32.0    male   Third   7.7500         0

[891 rows x 5 columns]

In [55]:
# class 열을 기준으로 분할
grouped = df.groupby(['class'], observed=True)

# fare 열을 그룹별로 누적 합산
grouped['fare'].cumsum()

0          7.2500
1         71.2833
2         15.1750
3        124.3833
4         23.2250
          ...
886     3801.8417
887    18147.4125
888     6706.9451
889    18177.4125
890     6714.6951
Name: fare, Length: 891, dtype: float64

In [56]:
# 변환 결과를 기존 데이터프레임의 열로 추가
df['fare_cumsum'] = grouped['fare'].cumsum()
df.head()

    age     sex  class     fare  survived  fare_cumsum
0  22.0    male  Third   7.2500         0       7.2500
1  38.0  female  First  71.2833         1      71.2833
2  26.0  female  Third   7.9250         1      15.1750
3  35.0  female  First  53.1000         1     124.3833
4  35.0    male  Third   8.0500         0      23.2250

In [57]:
# fare 열을 그룹별로 누적 합산
grouped[['fare']].transform('cumsum')

           fare
0        7.2500
1       71.2833
2       15.1750
3      124.3833
4       23.2250
..          ...
886   3801.8417
887  18147.4125
888   6706.9451
889  18177.4125
890   6714.6951

[891 rows x 1 columns]

In [58]:
# age, survived 열을 그룹별로 평균 계산
grouped[['age', 'survived']].transform('mean')

           age  survived
0    25.140620  0.242363
1    38.233441  0.629630
2    25.140620  0.242363
3    38.233441  0.629630
4    25.140620  0.242363
..         ...       ...
886  29.877630  0.472826
887  38.233441  0.629630
888  25.140620  0.242363
889  38.233441  0.629630
890  25.140620  0.242363

[891 rows x 2 columns]

In [59]:
# z-score를 계산하는 사용자 함수 정의
def z_score(x):
    return(x - x.mean()) / x.std()

# transform() 메소드를 이용하여 age열의 데이터를 z-score로 변환
age_zscore = grouped['age'].transform(z_score)
age_zscore

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

In [60]:
# z-score를 계산하는 람다 함수를 사용하여 변환
age_zscore2 = grouped['age'].transform(lambda x: (x - x.mean()) / x.std())
age_zscore2

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

In [61]:
# 내장 집계 함수를 사용하여 변환
age_zscore3 = (df['age'] - grouped['age'].transform('mean')) / grouped['age'].transform('std')
age_zscore3

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

<예제 6-10> 그룹 객체 필터링  ( 392page )

In [62]:
# class 열을 기준으로 분할
grouped = df.groupby(['class'], observed=True)

# 그룹별로 첫 2행을 확인
grouped_head = grouped.head(2)
grouped_head

     age     sex   class     fare  survived  fare_cumsum
0   22.0    male   Third   7.2500         0       7.2500
1   38.0  female   First  71.2833         1      71.2833
2   26.0  female   Third   7.9250         1      15.1750
3   35.0  female   First  53.1000         1     124.3833
9   14.0  female  Second  30.0708         1      30.0708
15  55.0  female  Second  16.0000         1      46.0708

In [63]:
# 각 그룹의 첫 번째 데이터 확인
grouped_first = grouped.nth(1)
grouped_first

     age     sex   class    fare  survived  fare_cumsum
2   26.0  female   Third   7.925         1      15.1750
3   35.0  female   First  53.100         1     124.3833
15  55.0  female  Second  16.000         1      46.0708

In [64]:
# 필터링이 적용된 그룹 객체의 열 부분 집합
grouped[['sex', 'survived']].nth(1)

       sex  survived
2   female         1
3   female         1
15  female         1

In [65]:
grouped_filter = grouped.filter(lambda x: len(x) >= 200)
grouped_filter

      age     sex  class     fare  survived  fare_cumsum
0    22.0    male  Third   7.2500         0       7.2500
1    38.0  female  First  71.2833         1      71.2833
2    26.0  female  Third   7.9250         1      15.1750
3    35.0  female  First  53.1000         1     124.3833
4    35.0    male  Third   8.0500         0      23.2250
..    ...     ...    ...      ...       ...          ...
885  39.0  female  Third  29.1250         0    6683.4951
887  19.0  female  First  30.0000         1   18147.4125
888   NaN  female  Third  23.4500         0    6706.9451
889  26.0    male  First  30.0000         1   18177.4125
890  32.0    male  Third   7.7500         0    6714.6951

[707 rows x 6 columns]

In [66]:
# age 열의 평균이 30보다 작은 그룹만을 필터링하여 데이터프레임으로 반환
age_filter = grouped.filter(lambda x: x['age'].mean() < 30)
age_filter

      age     sex   class     fare  survived  fare_cumsum
0    22.0    male   Third   7.2500         0       7.2500
2    26.0  female   Third   7.9250         1      15.1750
4    35.0    male   Third   8.0500         0      23.2250
5     NaN    male   Third   8.4583         0      31.6833
7     2.0    male   Third  21.0750         0      52.7583
..    ...     ...     ...      ...       ...          ...
884  25.0    male   Third   7.0500         0    6654.3701
885  39.0  female   Third  29.1250         0    6683.4951
886  27.0    male  Second  13.0000         0    3801.8417
888   NaN  female   Third  23.4500         0    6706.9451
890  32.0    male   Third   7.7500         0    6714.6951

[675 rows x 6 columns]

<예제 6-11> 그룹 객체에 함수 매핑  ( 396page )

In [67]:
# class 열을 기준으로 분할
grouped = df.groupby(['class'], observed=True)

# 집계 : 각 그룹별 요약 통계정보 집계
agg_grouped = grouped[['age', 'survived']].apply(lambda x: x.describe())
agg_grouped

                     age    survived
class
First  count  186.000000  216.000000
       mean    38.233441    0.629630
       std     14.802856    0.484026
       min      0.920000    0.000000
       25%     27.000000    0.000000
       50%     37.000000    1.000000
       75%     49.000000    1.000000
       max     80.000000    1.000000
Second count  173.000000  184.000000
       mean    29.877630    0.472826
       std     14.001077    0.500623
       min      0.670000    0.000000
       25%     23.000000    0.000000
       50%     29.000000    0.000000
       75%     36.000000    1.000000
       max     70.000000    1.000000
Third  count  355.000000  491.000000
       mean    25.140620    0.242363
       std     12.495398    0.428949
       min      0.420000    0.000000
       25%     18.000000    0.000000
       50%     24.000000    0.000000
       75%     32.000000    0.000000
       max     74.000000    1.000000

In [68]:
# 변환: z-score 계산
def z_score(x):
    return (x- x.mean()) / x.std()

age_zscore = grouped[['age', 'survived']].apply(z_score)
age_zscore

                age  survived
class
First 1   -0.015770  0.765188
      3   -0.218434  0.765188
      6    1.065103 -1.300819
      11   1.335321  0.765188
      23  -0.691315  0.765188
...             ...       ...
Third 882 -0.251342 -0.565014
      884 -0.011254 -0.565014
      885  1.109159 -0.565014
      888       NaN -0.565014
      890  0.548953 -0.565014

[891 rows x 2 columns]

In [69]:
# 필터링 : age 열의 데이터 평균이 30보다 작은 그룹만을 필터링하여 출력
age_filter = grouped[['age', 'survived']].apply(lambda x: x['age'].mean() < 30)
print(age_filter, '\n')

# 필터링 결과로 조건을 충족하는 데이터프레임 변환
df.loc[df['class'].isin(age_filter[age_filter==True].index), ['age', 'survived']]

class
First     False
Second     True
Third      True
dtype: bool

      age  survived
0    22.0         0
2    26.0         1
4    35.0         0
5     NaN         0
7     2.0         0
..    ...       ...
884  25.0         0
885  39.0         0
886  27.0         0
888   NaN         0
890  32.0         0

[675 rows x 2 columns]

- 4. 멀티 인덱스

<예제 6-12> 멀티 인덱스  ( 399page )

In [70]:
# class 열을 기준으로 분할
grouped = df.groupby(['class', 'sex'], observed=True)

# 그룹 객체에 연산 메소드 적용
gdf = grouped.agg(['mean', 'std'], numeric_only = True)
gdf

                     age                   fare             survived  \
                    mean        std        mean        std      mean
class  sex
First  female  34.611765  13.612052  106.125798  74.259988  0.968085
       male    41.281386  15.139570   67.226127  77.548021  0.368852
Second female  28.722973  12.872702   21.970121  10.891796  0.921053
       male    30.740707  14.793894   19.741782  14.922235  0.157407
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000
       male    26.507589  12.159514   12.661633  11.681696  0.135447

                         fare_cumsum
                    std         mean          std
class  sex
First  female  0.176716  9417.645071  5502.431968
       male    0.484484  9140.709907  5417.219290
Second female  0.271448  1876.618101  1057.277330
       male    0.365882  1916.574033  1118.345065
Third  female  0.501745  3079.955875  1919.602019
       male    0.342694  3474.996019  1859.328795

In [71]:
# 인덱스 속성 확인하기
gdf.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [72]:
# 멀티 인덱스 만들기 - 배열의 리스트 이용
arrays = [['a','a','b','b'], [1,2,1,2]]
multi_index_arrays = pd.MultiIndex.from_arrays(arrays, names=('letter', 'number'))
multi_index_arrays

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [73]:
# 멀티 인덱스 만들기 - 튜플의 배열 이용
tuples = [('a', 1), ('a', 2), ('b', 1), ('b', 2)]
multi_index_tuples = pd.MultiIndex.from_tuples(tuples, names=('letter', 'number'))
multi_index_tuples

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [74]:
# 멀티 인덱스 만들기 - 교차 반복 객체를 이용
letters = ['a','b']
numbers = [1, 2]
multi_index_product = pd.MultiIndex.from_product([letters, numbers],
                                                 names=('letter','number'))
multi_index_product

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [75]:
# 멀티 인덱스 만들기 - 데이터프레임을 이용
df = pd.DataFrame([['a', 1], ['a', 2], ['b', 1], ['b', 2]], columns=['letter','number'])
multi_index_frame = pd.MultiIndex.from_frame(df)
multi_index_frame

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [76]:
# 멀티인덱스의 특정 레벨을 추출
multi_index_frame.get_level_values(0)

Index(['a', 'a', 'b', 'b'], dtype='object', name='letter')

In [77]:
# 멀티인덱스의 특정 레벨을 추출
multi_index_frame.get_level_values('letter')

Index(['a', 'a', 'b', 'b'], dtype='object', name='letter')

In [78]:
# 열 이름의 멀티 인덱스 확인
gdf.columns.levels

FrozenList([['age', 'fare', 'survived', 'fare_cumsum'], ['mean', 'std']])

In [79]:
# 레벨을 지정하여 열 인덱스 추출
gdf.columns.get_level_values(1)

Index(['mean', 'std', 'mean', 'std', 'mean', 'std', 'mean', 'std'], dtype='object')

In [80]:
# age 변수의 데이터를 선택
gdf['age']

                    mean        std
class  sex
First  female  34.611765  13.612052
       male    41.281386  15.139570
Second female  28.722973  12.872702
       male    30.740707  14.793894
Third  female  21.750000  12.729964
       male    26.507589  12.159514

In [81]:
# age 변수의 평균값 데이터를 선택
gdf['age','mean']

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: (age, mean), dtype: float64

In [82]:
# age 변수를 먼저 선택하고, 다시 평균값 데이터를 선택
gdf['age']['mean']

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: mean, dtype: float64

In [83]:
# class 값이 First인 행을 선택
gdf.loc['First']

              age                   fare             survived            \
             mean        std        mean        std      mean       std
sex
female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484

        fare_cumsum
               mean          std
sex
female  9417.645071  5502.431968
male    9140.709907  5417.219290

In [84]:
# class 값이 First고, sex 값이 female인 행을 선택
gdf.loc[('First', 'female')]

age          mean      34.611765
             std       13.612052
fare         mean     106.125798
             std       74.259988
survived     mean       0.968085
             std        0.176716
fare_cumsum  mean    9417.645071
             std     5502.431968
Name: (First, female), dtype: float64

In [85]:
# class 값이 First이고, sex 값이 female인 행의 'age' 열을 선택
gdf.loc[('First','female'), 'age']

mean    34.611765
std     13.612052
Name: (First, female), dtype: float64

In [86]:
# class 값이 First이고, sex 값이 female인 행의 'age' 열의 'mean' 선택
gdf.loc[('First', 'female'), ('age', 'mean')]

np.float64(34.61176470588235)

In [87]:
# First이고 female인 행의 'age'열의 'std'부터 'fare'열의 'mean'열까지의 범위 선택
gdf.loc[('First', 'female'), ('age','std'):('fare','mean')]

age   std      13.612052
fare  mean    106.125798
Name: (First, female), dtype: float64

In [88]:
# 특정 레벨에서 교차 섹션(cross-section) 이용 - sex 값이 male인 데이터를 선택
male_class = gdf.xs('male', level='sex')
male_class

              age                  fare             survived            \
             mean        std       mean        std      mean       std
class
First   41.281386  15.139570  67.226127  77.548021  0.368852  0.484484
Second  30.740707  14.793894  19.741782  14.922235  0.157407  0.365882
Third   26.507589  12.159514  12.661633  11.681696  0.135447  0.342694

        fare_cumsum
               mean          std
class
First   9140.709907  5417.219290
Second  1916.574033  1118.345065
Third   3474.996019  1859.328795

In [89]:
# 멀티인덱스 정렬
gdf.sort_index(level=0, ascending=False)

                     age                   fare             survived  \
                    mean        std        mean        std      mean
class  sex
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447
       female  21.750000  12.729964   16.118810  11.690314  0.500000
Second male    30.740707  14.793894   19.741782  14.922235  0.157407
       female  28.722973  12.872702   21.970121  10.891796  0.921053
First  male    41.281386  15.139570   67.226127  77.548021  0.368852
       female  34.611765  13.612052  106.125798  74.259988  0.968085

                         fare_cumsum
                    std         mean          std
class  sex
Third  male    0.342694  3474.996019  1859.328795
       female  0.501745  3079.955875  1919.602019
Second male    0.365882  1916.574033  1118.345065
       female  0.271448  1876.618101  1057.277330
First  male    0.484484  9140.709907  5417.219290
       female  0.176716  9417.645071  5502.431968

In [90]:
# 멀티인덱스 정렬
gdf.sort_index(level='sex', ascending=False)

                     age                   fare             survived  \
                    mean        std        mean        std      mean
class  sex
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447
Second male    30.740707  14.793894   19.741782  14.922235  0.157407
First  male    41.281386  15.139570   67.226127  77.548021  0.368852
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000
Second female  28.722973  12.872702   21.970121  10.891796  0.921053
First  female  34.611765  13.612052  106.125798  74.259988  0.968085

                         fare_cumsum
                    std         mean          std
class  sex
Third  male    0.342694  3474.996019  1859.328795
Second male    0.365882  1916.574033  1118.345065
First  male    0.484484  9140.709907  5417.219290
Third  female  0.501745  3079.955875  1919.602019
Second female  0.271448  1876.618101  1057.277330
First  female  0.176716  9417.645071  5502.431968

In [91]:
# 멀티인덱스 정렬
gdf.sort_index(level=['sex', 'class'], ascending=[False, True])

                     age                   fare             survived  \
                    mean        std        mean        std      mean
class  sex
First  male    41.281386  15.139570   67.226127  77.548021  0.368852
Second male    30.740707  14.793894   19.741782  14.922235  0.157407
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447
First  female  34.611765  13.612052  106.125798  74.259988  0.968085
Second female  28.722973  12.872702   21.970121  10.891796  0.921053
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000

                         fare_cumsum
                    std         mean          std
class  sex
First  male    0.484484  9140.709907  5417.219290
Second male    0.365882  1916.574033  1118.345065
Third  male    0.342694  3474.996019  1859.328795
First  female  0.176716  9417.645071  5502.431968
Second female  0.271448  1876.618101  1057.277330
Third  female  0.501745  3079.955875  1919.602019